string[] array = new string[5] { "123ww", "56e7", "hele", "wo3333", "res333" };
string[] newarr = new string[array. Длина];
void Массив MetodArray(string[])
{
    Система. Консоль. Писать("[");
    для (int i = 0; I < массив. Длина; я++)
    {
        if (массив[i]. Длина <= 3)
        {
            newarr[i] = массив[i];
            Консоль. Write($"{newarr[i]}, ");
        }
    }
    Система. Консоль. Писать("]");
}

void Массив PrintArray(string[])
{
    Система. Консоль. Писать("[");
    для (int i = 0; I < массив. Длина; я++)
    {
        Консоль. Write($"{array[i]}, ");
    }
    Система. Консоль. Писать("]");
}
Система. Консоль. WriteLine();
ПечатьРастра(массив));
Система. Консоль. Писать("->");
МетодАршай(массив));
Система. Консоль. WriteLine();
Система. Консоль. WriteLine();